## Tianyi Zhang 9598110243

### 1. Setting up an Integrated Development Environment (IDE)

### 2. Google Colab

### 3. Pandas

In [72]:
import pandas as pd

In [73]:
# data3b = pd.read_csv('Salaries.csv')

In [74]:
data3c = pd.read_csv('Salaries.csv', index_col = 3, header=0, skiprows=range(1, 2))

print(data3c.index)
print(data3c.columns)
# print(data3c.iloc[0])

print(data3c.head(5))

Index(['bedrost01', 'benedbr01', 'campri01', 'ceronri01', 'chambch01',
       'dedmoje01', 'forstte01', 'garbege01', 'harpete01', 'hornebo01',
       ...
       'stammcr01', 'storedr01', 'strasst01', 'taylomi02', 'thornma01',
       'treinbl01', 'ugglada01', 'werthja01', 'zimmejo02', 'zimmery01'],
      dtype='object', name='playerID', length=25574)
Index(['yearID', 'teamID', 'lgID', 'salary'], dtype='object')
           yearID teamID lgID  salary
playerID
bedrost01    1985    ATL   NL  550000
benedbr01    1985    ATL   NL  545000
campri01     1985    ATL   NL  633333
ceronri01    1985    ATL   NL  625000
chambch01    1985    ATL   NL  800000

In [75]:
data3d = data3c[data3c.teamID == ('ATL' or 'HOU')]

print(data3d.shape)
data3d = data3d[data3d.salary > 1000000]

print(data3d.shape)
print(data3d.head(5))

(885, 4)
(325, 4)
           yearID teamID lgID   salary
playerID
hornebo01    1985    ATL   NL  1500000
murphda05    1985    ATL   NL  1625000
suttebr01    1985    ATL   NL  1354167
hornebo01    1986    ATL   NL  1800000
murphda05    1986    ATL   NL  1825000

In [76]:
data3e = data3c[data3c.teamID == 'ATL']

data3e.describe()

            yearID        salary
count   885.000000  8.850000e+02
mean   1999.725424  2.207749e+06
std       8.766470  3.434320e+06
min    1985.000000  6.000000e+04
25%    1992.000000  3.000000e+05
50%    1999.000000  6.000000e+05
75%    2007.000000  2.400000e+06
max    2015.000000  1.606180e+07

In [79]:
# print(data3c.shape)
for index, data in data3c.iterrows():
    data3f['yearID'].append(data[0])
    data3f['teamID'].append(data[1])
    data3f['lgID'].append(data[2])
    data3f['salary'].append(data[3])
# print(data[0], data[1], data[2], data[3])

print(data3f.keys())
print(len(data3f['salary']))


data3f = data3c.to_dict('list')

(25574, 4)
dict_keys(['yearID', 'teamID', 'lgID', 'salary'])
460332

### 4. Numpy

### 5. Scikit-Learn

### 6. Git and GitHub

### 7. Matplotlib

### 8. Seaborn